AccumulationRegisters/ЛБ_ОбъектыЗалогаВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ЦеныОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЦеныОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_НазначениеГруппыОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_НазначениеГруппыОбъектамЗалога</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГруппыОбъектовЗалога</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНазначенияГруппы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ЛБ_ПросмотрИзделийВПути/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда 
			Отказ = Истина;
		КонецЕсли;	
	Иначе
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
	    Дата = ТекущаяДатаСеанса(); 
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
	    Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	КонецЕсли;
	УстановитьОтбиратьПоОткуда();
	УстановитьОтбиратьПоКуда();   
	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов(ЛомбардОткуда));
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов(ЛомбардКуда));
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеЗалогов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_ПеремещениеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОприходованиеЗалогов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_ОприходованиеОбъектовЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьГруппу(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ОткрытьФорму("Документ.ЛБ_НазначениеГруппыОбъектамЗалога.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПодразделений()  
	СписокПодразделений = Новый СписокЗначений;
	Если ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		СписокПодразделений.Добавить(ЛомбардОткуда);
	ИначеЕсли ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
		Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), ЛомбардОткуда);
	КонецЕсли;
	Возврат СписокПодразделений;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Организация", Организация);  
	Условие = "";
	Если ЗначениеЗаполнено(ЛомбардОткуда) Тогда
		//lion++
		//Запрос.УстановитьПараметр("Отправитель", ЛомбардОткуда);
		//Условие = Условие + " И Отправитель = &Отправитель";
		Если ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			ЛомбардыОткуда=ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(Дата,ЛомбардОткуда);
			Запрос.УстановитьПараметр("ЛомбардыОткуда", ЛомбардыОткуда);
			Условие = Условие + " И Отправитель в (&ЛомбардыОткуда)";
		иначе
			Запрос.УстановитьПараметр("Отправитель", ЛомбардОткуда);
			Условие = Условие + " И Отправитель = &Отправитель";
		КонецЕсли;
		//lion--
	КонецЕсли;	  
	Если ЗначениеЗаполнено(СкладОтправитель) Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
        Условие = Условие + " И СкладОтправитель = &СкладОтправитель"; 
	КонецЕсли;    
	Если ЗначениеЗаполнено(ЛомбардКуда) Тогда  
		Запрос.УстановитьПараметр("Получатель", ЛомбардКуда);
        Условие = Условие + " И Получатель = &Получатель";
	КонецЕсли;	  
	Если ЗначениеЗаполнено(СкладПолучатель) Тогда
		Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
        Условие = Условие + " И СкладПолучатель = &СкладПолучатель";    //" + Условие + "
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.КоличествоОстаток КАК Количество,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_ОбъектыЗалогаВПутиОстатки.Инкассатор КАК Инкассатор,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена КАК Цена,
	               |	ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Период КАК ДатаЦены
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути.Остатки(&Дата, Организация = &Организация" + Условие + ") КАК ЛБ_ОбъектыЗалогаВПутиОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаВПутиОстатки.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаВПутиОстатки.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса);  
	
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");        
	ИтогВесИзделия = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
	ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс");
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");      
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды");  
	ИтогЦена = ТаблицаТоваров.Итог("Цена");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса(); 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуНаТекущуюДату(Команда)
	Дата = ПолучитьТекущуюДатуСеанса();
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбиратьПоОткуда()
	Если ОтбиратьПоОткуда = 0 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";	
		Элементы.СкладОтправитель.ТолькоПросмотр = Ложь;   
		//lion Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
		Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) <> Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			ЛомбардОткуда = неопределено;
		КонецЕсли;	
	ИначеЕсли ОтбиратьПоОткуда = 1 Тогда
		ТипСтр = "СправочникСсылка._ДемоКонтрагенты";
		Элементы.СкладОтправитель.ТолькоПросмотр = Истина; 
		//lion Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) <> Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
			ЛомбардОткуда = неопределено;
		КонецЕсли;	
	//lion+++
	ИначеЕсли ОтбиратьПоОткуда = 2 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_ОтделенияЛомбардов";	
		Элементы.СкладОтправитель.ТолькоПросмотр = Ложь;   
		//lion Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
		Если ЗначениеЗаполнено(ЛомбардОткуда) И ТипЗнч(ЛомбардОткуда) <> Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			ЛомбардОткуда = неопределено;
		КонецЕсли;
	//lion---
	КонецЕсли;	 
	Элементы.ЛомбардОткуда.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.ЛомбардОткуда.ВыбиратьТип = Ложь; 
	Элементы.СкладОтправитель.СписокВыбора.Очистить();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбиратьПоКуда()
	Если ОтбиратьПоКуда = 0 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";	
		Элементы.СкладПолучатель.ТолькоПросмотр = Ложь;   
		Если ЗначениеЗаполнено(ЛомбардКуда) И ТипЗнч(ЛомбардКуда) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
			ЛомбардКуда = неопределено;
		КонецЕсли;	
	ИначеЕсли ОтбиратьПоКуда = 1 Тогда
		ТипСтр = "СправочникСсылка._ДемоКонтрагенты";
		Элементы.СкладПолучатель.ТолькоПросмотр = Истина; 
		Если ЗначениеЗаполнено(ЛомбардКуда) И ТипЗнч(ЛомбардКуда) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			ЛомбардКуда = неопределено;;
		КонецЕсли;	
	КонецЕсли;	
	Элементы.ЛомбардКуда.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.ЛомбардКуда.ВыбиратьТип = Ложь; 
	Элементы.СкладПолучатель.СписокВыбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоОткудаПриИзменении(Элемент)
	УстановитьОтбиратьПоОткуда();               
	СкладОтправитель = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка");
	ТаблицаТоваров.Очистить();
КонецПроцедуры 

&НаКлиенте
Процедура ОтбиратьПоКудаПриИзменении(Элемент)
	УстановитьОтбиратьПоКуда();               
	СкладПолучатель = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка"); 
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард) 
	МассивСкладов = Новый Массив;
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос; 
		Запрос.УстановитьПараметр("Владелец", Ломбард);
		//+МАН 25.12.25 Изменил запрос. Заявка 3269
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ЛБ_Склады.Ссылка КАК Ссылка
		//               |ИЗ
		//               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		//               |ГДЕ
		//               |	ЛБ_Склады.Владелец = &Владелец";
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И НЕ (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		//-МАН
		Выборка = Запрос.Выполнить().Выбрать();     
		Пока Выборка.Следующий() Цикл 
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;	
	КонецЕсли;
	Возврат МассивСкладов;
КонецФункции

&НаКлиенте
Процедура ЛомбардОткудаПриИзменении(Элемент) 
	ТипОткуда = ПолучитьТипКудаОткуда(ЛомбардОткуда);
	Если (ОтбиратьПоОткуда = 0 И ТипОткуда = 1) ИЛИ  
		(ОтбиратьПоОткуда = 1 И ТипОткуда = 0) Тогда
        УстановитьОтбиратьПоОткуда();   
	Иначе	  
	    Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов(ЛомбардОткуда)); 
	КонецЕсли;	 
	ТаблицаТоваров.Очистить();
КонецПроцедуры   

&НаСервере
Функция ПолучитьТипКудаОткуда(Ломбард)
	Если ТипЗнч(Ломбард) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЛомбардКудаПриИзменении(Элемент) 
	ТипКуда = ПолучитьТипКудаОткуда(ЛомбардКуда);
	Если (ОтбиратьПоКуда = 0 И ТипКуда = 1) ИЛИ  
		(ОтбиратьПоКуда = 1 И ТипКуда = 0) Тогда
        УстановитьОтбиратьПоКуда();   
	Иначе	  
	    Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов(ЛомбардКуда)); 
	КонецЕсли;	
	ТаблицаТоваров.Очистить();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаТоваров.НайтиПоИдентификатору(Идентификатор); 
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ЗБ", Стр.ЗалоговыйБилет);
	СтруктураВ.Вставить("Залогодатель", Стр.ЗалоговыйБилет.Залогодатель);
	Возврат СтруктураВ;
КонецФункции	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		Результат = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Результат.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", Результат.ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	ТаблицаТоваров.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	ТаблицаТоваров.Очистить();
КонецПроцедуры
